Rating/Request/Old/Alberta_UT_Request_Legacy.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v4="http://wsc.tdigi/calculatepremium/calculateautopremium/request/v4">
   <soapenv:Header/>
   <soapenv:Body>
      <v4:calculateAutoPremium>
         <CalculateAutoPremiumRequest>
<AutomobilePolicy>
<PortfolioNumber>9948332</PortfolioNumber>
<ContractNumber>13485581</ContractNumber>
<EffectiveDate>2018-02-19T00:00:00-05:00</EffectiveDate>
<IsAutomaticRating>true</IsAutomaticRating>
<IsOriginalContract>true</IsOriginalContract>
<OriginalCreationDate>2018-02-19-05:00</OriginalCreationDate>
<EndDate>2019-02-19T00:00:00-05:00</EndDate>
<RatingSource>CallCenter</RatingSource>
<Insurer>
<InsurerName>SNIC</InsurerName>
<InsurerNumber>5421</InsurerNumber>
</Insurer>
<LineOfBusiness>AUTOMOBILE</LineOfBusiness>
<VersionEffectiveDate>2018-02-19T00:00:00-05:00</VersionEffectiveDate>
<RateDate>2018-06-19-05:00</RateDate>
<ClientGroupNumber>1333</ClientGroupNumber>
<RatingGroupNumber>1333</RatingGroupNumber>
<TransactionType>NewBusiness</TransactionType>
<Address>
<DisplayPostalZipCode>T2H3B3</DisplayPostalZipCode>
<DisplayProvinceState>AB</DisplayProvinceState>
</Address>
<AutomobilePolicyCounters>
<AutomobilePolicyCounter>
<VehicleType>AT</VehicleType>
</AutomobilePolicyCounter>
<AutomobilePolicyCounter>
<VehicleType>AU</VehicleType>
</AutomobilePolicyCounter>
<AutomobilePolicyCounter>
<VehicleType>MC</VehicleType>
</AutomobilePolicyCounter>
<AutomobilePolicyCounter>
<VehicleType>MH</VehicleType>
</AutomobilePolicyCounter>
<AutomobilePolicyCounter>
<VehicleType>SM</VehicleType>
</AutomobilePolicyCounter>
<AutomobilePolicyCounter>
<VehicleType>TF</VehicleType>
</AutomobilePolicyCounter>
<AutomobilePolicyCounter>
<VehicleType>UT</VehicleType>
</AutomobilePolicyCounter>
</AutomobilePolicyCounters>
<Coverages/>
<Vehicles>
<Vehicle>
<EffectiveDate>2018-02-19T00:00:00-05:00</EffectiveDate>
<IsActive>true</IsActive>
<IsRatedByValue>false</IsRatedByValue>
<PurchaseDate>2018-02-19-05:00</PurchaseDate>
<PurchasePrice>7000</PurchasePrice>
<VehicleNumber>1</VehicleNumber>
<VehicleType>UT</VehicleType>
<SubVehicleType>UT</SubVehicleType>
<ClientAssessmentScore>636</ClientAssessmentScore>
<RSPInformation>
<IsRSPAssignedByAnalyst>false</IsRSPAssignedByAnalyst>
</RSPInformation>
<ProtectionDevices/>
<VehicleRatingGroup>
<AccidentBenefit>5</AccidentBenefit>
<Collision>4</Collision>
<Comprehensive>3</Comprehensive>
<ThirdParty>4</ThirdParty>
</VehicleRatingGroup>
<MakeModel>
<IsAntique>false</IsAntique>
<IsFiberglass>false</IsFiberglass>
<IsHighPerformance>false</IsHighPerformance>
<IsModernClassic>false</IsModernClassic>
<IsModifiedVehicle>false</IsModifiedVehicle>
<IsNewVehicle>false</IsNewVehicle>
<IsOlderVehicle>false</IsOlderVehicle>
<IsWinterTire>false</IsWinterTire>
<Year>2015</Year>
<VICCCodeMultiple/>
</MakeModel>
<VehicleAlbertaGrid>
<RateDate>2018-06-19-05:00</RateDate>
</VehicleAlbertaGrid>
<RatingVehicleInfo>
<IsAddedOnPolicyVersion>false</IsAddedOnPolicyVersion>
<IsCappingEvaluationRequired>false</IsCappingEvaluationRequired>
<IsRenewed>false</IsRenewed>
</RatingVehicleInfo>
</Vehicle>
</Vehicles>
<VehicleDriverUsages>
<VehicleDriverUsage>
<AnnualMileage>5000</AnnualMileage>
<BusinessMileage>0</BusinessMileage>
<WorkMileage>0</WorkMileage>
<DriverNumber>1</DriverNumber>
<VehicleNumber>1</VehicleNumber>
<Risk>
<RateDate>2018-06-19-05:00</RateDate>
<Territory>
<RiskPostalCodeFSA>T2H</RiskPostalCodeFSA>
<RiskPostalCodeLDU>3B3</RiskPostalCodeLDU>
</Territory>
<Coverages>
<Coverage>
<CoverageCode>TPL</CoverageCode>
<CoverageTypeCode>Coverage</CoverageTypeCode>
<IsActive>true</IsActive>
<Limit>1000000</Limit>
<RatedDeductible>0</RatedDeductible>
</Coverage>
<Coverage>
<CoverageCode>AB</CoverageCode>
<CoverageTypeCode>Coverage</CoverageTypeCode>
<IsActive>true</IsActive>
<Limit>0</Limit>
<RatedDeductible>0</RatedDeductible>
</Coverage>
<Coverage>
<CoverageCode>COL</CoverageCode>
<CoverageTypeCode>Coverage</CoverageTypeCode>
<IsActive>true</IsActive>
<Limit>0</Limit>
<RatedDeductible>250</RatedDeductible>
</Coverage>
<Coverage>
<CoverageCode>CMP</CoverageCode>
<CoverageTypeCode>Coverage</CoverageTypeCode>
<IsActive>true</IsActive>
<Limit>0</Limit>
<RatedDeductible>100</RatedDeductible>
</Coverage>
</Coverages>
<DiscountSurcharges>
<DiscountSurcharge>
<DiscountSurchargeCode>R3</DiscountSurchargeCode>
<IsActive>false</IsActive>
</DiscountSurcharge>
<DiscountSurcharge>
<DiscountSurchargeCode>CAP</DiscountSurchargeCode>
<IsActive>false</IsActive>
</DiscountSurcharge>
<DiscountSurcharge>
<DiscountSurchargeCode>DISCG</DiscountSurchargeCode>
<IsActive>false</IsActive>
</DiscountSurcharge>
<DiscountSurcharge>
<DiscountSurchargeCode>DISML</DiscountSurchargeCode>
<IsActive>false</IsActive>
</DiscountSurcharge>
<DiscountSurcharge>
<DiscountSurchargeCode>SURD1</DiscountSurchargeCode>
<IsActive>false</IsActive>
</DiscountSurcharge>
</DiscountSurcharges>
</Risk>
<CurrentVehicleUsageType>Principal</CurrentVehicleUsageType>
</VehicleDriverUsage>
</VehicleDriverUsages>
<DriverInformations>
<DriverInformation>
<DriverNumber>1</DriverNumber>
<EffectiveDate>2018-02-19-05:00</EffectiveDate>
<IsActive>true</IsActive>
<IsAddedOnPolicyVersion>false</IsAddedOnPolicyVersion>
<IsPrincipalOnAnotherTDAPolicy>false</IsPrincipalOnAnotherTDAPolicy>
<KmFromPrimaryResidence>0</KmFromPrimaryResidence>
<DriverExperienceDates>
<DriverExperienceDate>
<VehicleType>UT</VehicleType>
</DriverExperienceDate>
</DriverExperienceDates>
<DriverExperiences>
<DriverExperience>
<YearOld>1</YearOld>
<IncidentType>AtFaultAccident</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>1</YearOld>
<IncidentType>ComprehensiveClaim</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>1</YearOld>
<IncidentType>NotAtFaultAccident</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>1</YearOld>
<IncidentType>MinorConviction</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>1</YearOld>
<IncidentType>MajorConviction</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>1</YearOld>
<IncidentType>SeriousConviction</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>1</YearOld>
<IncidentType>SuspensionLessThanOneYear</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>1</YearOld>
<IncidentType>SuspensionOneYearOrMore</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>2</YearOld>
<IncidentType>AtFaultAccident</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>2</YearOld>
<IncidentType>ComprehensiveClaim</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>2</YearOld>
<IncidentType>NotAtFaultAccident</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>2</YearOld>
<IncidentType>MinorConviction</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>2</YearOld>
<IncidentType>MajorConviction</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>2</YearOld>
<IncidentType>SeriousConviction</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>2</YearOld>
<IncidentType>SuspensionLessThanOneYear</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>2</YearOld>
<IncidentType>SuspensionOneYearOrMore</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>3</YearOld>
<IncidentType>AtFaultAccident</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>3</YearOld>
<IncidentType>ComprehensiveClaim</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>3</YearOld>
<IncidentType>NotAtFaultAccident</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>3</YearOld>
<IncidentType>MinorConviction</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>3</YearOld>
<IncidentType>MajorConviction</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>3</YearOld>
<IncidentType>SeriousConviction</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>3</YearOld>
<IncidentType>SuspensionLessThanOneYear</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>3</YearOld>
<IncidentType>SuspensionOneYearOrMore</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>4</YearOld>
<IncidentType>AtFaultAccident</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>4</YearOld>
<IncidentType>ComprehensiveClaim</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>4</YearOld>
<IncidentType>NotAtFaultAccident</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>4</YearOld>
<IncidentType>MinorConviction</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>4</YearOld>
<IncidentType>MajorConviction</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>4</YearOld>
<IncidentType>SeriousConviction</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>4</YearOld>
<IncidentType>SuspensionLessThanOneYear</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>4</YearOld>
<IncidentType>SuspensionOneYearOrMore</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>5</YearOld>
<IncidentType>AtFaultAccident</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>5</YearOld>
<IncidentType>ComprehensiveClaim</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>5</YearOld>
<IncidentType>NotAtFaultAccident</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>5</YearOld>
<IncidentType>MinorConviction</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>5</YearOld>
<IncidentType>MajorConviction</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>5</YearOld>
<IncidentType>SeriousConviction</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>5</YearOld>
<IncidentType>SuspensionLessThanOneYear</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>5</YearOld>
<IncidentType>SuspensionOneYearOrMore</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>6</YearOld>
<IncidentType>AtFaultAccident</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>6</YearOld>
<IncidentType>ComprehensiveClaim</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>6</YearOld>
<IncidentType>NotAtFaultAccident</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>6</YearOld>
<IncidentType>MinorConviction</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>6</YearOld>
<IncidentType>MajorConviction</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>6</YearOld>
<IncidentType>SeriousConviction</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>6</YearOld>
<IncidentType>SuspensionLessThanOneYear</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>6</YearOld>
<IncidentType>SuspensionOneYearOrMore</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>7</YearOld>
<IncidentType>AtFaultAccident</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>7</YearOld>
<IncidentType>ComprehensiveClaim</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>7</YearOld>
<IncidentType>NotAtFaultAccident</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>7</YearOld>
<IncidentType>MinorConviction</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>7</YearOld>
<IncidentType>MajorConviction</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>7</YearOld>
<IncidentType>SeriousConviction</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>7</YearOld>
<IncidentType>SuspensionLessThanOneYear</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>7</YearOld>
<IncidentType>SuspensionOneYearOrMore</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>8</YearOld>
<IncidentType>AtFaultAccident</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>8</YearOld>
<IncidentType>ComprehensiveClaim</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>8</YearOld>
<IncidentType>NotAtFaultAccident</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>8</YearOld>
<IncidentType>MinorConviction</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>8</YearOld>
<IncidentType>MajorConviction</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>8</YearOld>
<IncidentType>SeriousConviction</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>8</YearOld>
<IncidentType>SuspensionLessThanOneYear</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>8</YearOld>
<IncidentType>SuspensionOneYearOrMore</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>9</YearOld>
<IncidentType>AtFaultAccident</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>9</YearOld>
<IncidentType>ComprehensiveClaim</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>9</YearOld>
<IncidentType>NotAtFaultAccident</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>9</YearOld>
<IncidentType>MinorConviction</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>9</YearOld>
<IncidentType>MajorConviction</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>9</YearOld>
<IncidentType>SeriousConviction</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>9</YearOld>
<IncidentType>SuspensionLessThanOneYear</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>9</YearOld>
<IncidentType>SuspensionOneYearOrMore</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>10</YearOld>
<IncidentType>AtFaultAccident</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>10</YearOld>
<IncidentType>ComprehensiveClaim</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>10</YearOld>
<IncidentType>NotAtFaultAccident</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>10</YearOld>
<IncidentType>MinorConviction</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>10</YearOld>
<IncidentType>MajorConviction</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>10</YearOld>
<IncidentType>SeriousConviction</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>10</YearOld>
<IncidentType>SuspensionLessThanOneYear</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
<DriverExperience>
<YearOld>10</YearOld>
<IncidentType>SuspensionOneYearOrMore</IncidentType>
<VehicleType>UT</VehicleType>
</DriverExperience>
</DriverExperiences>
<DriverAlbertaGrid/>
<DriverCounters>
<DriverCounter>
<VehicleType>AT</VehicleType>
</DriverCounter>
<DriverCounter>
<VehicleType>AU</VehicleType>
</DriverCounter>
<DriverCounter>
<VehicleType>MC</VehicleType>
</DriverCounter>
<DriverCounter>
<VehicleType>MH</VehicleType>
</DriverCounter>
<DriverCounter>
<VehicleType>SM</VehicleType>
</DriverCounter>
<DriverCounter>
<VehicleType>TF</VehicleType>
</DriverCounter>
<DriverCounter>
<VehicleType>UT</VehicleType>
</DriverCounter>
</DriverCounters>
<Individual>
<BirthDate>1975-06-02-05:00</BirthDate>
<MaritalStatus>Single</MaritalStatus>
<MaritalStatusSince/>
<Gender>Female</Gender>
<LicenseSuspensions/>
<Licenses>
<License>
<IsDriverTraining>false</IsDriverTraining>
<IsLicenseNumberAccepted>true</IsLicenseNumberAccepted>
<LicenseClassCode>PrivatePassenger</LicenseClassCode>
<LicenseDate>1995-06-01-05:00</LicenseDate>
<LicenseNumber>1802191126</LicenseNumber>
</License>
</Licenses>
<Convictions/>
<PolicyClaims/>
</Individual>
</DriverInformation>
</DriverInformations>
<DriverVehicleList>
</DriverVehicleList>
<LocationList>
<Location>
<ResidenceType>PO</ResidenceType>
</Location>
</LocationList>
<Territory>
<RiskPostalCodeFSA>T2H</RiskPostalCodeFSA>
<RiskPostalCodeLDU>3B3</RiskPostalCodeLDU>
</Territory>
</AutomobilePolicy>
</CalculateAutoPremiumRequest>
<EnvironmentIdentification>
<EnvironmentID>F01</EnvironmentID>
</EnvironmentIdentification>
      </v4:calculateAutoPremium>
   </soapenv:Body>
</soapenv:Envelope>
